In [1]:
# https:mitu.co.in/dataset
# student.csv, fb.csv, cricket.csv, Social_Network_Ads.csv

In [2]:
import os
os.getcwd()

'/home/mitu'

In [3]:
import pandas as pd

In [4]:
df = pd.read_csv('student.csv')

In [5]:
df

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [6]:
df.shape

(10, 5)

In [7]:
df.columns

Index(['roll', 'name', 'class', 'marks', 'age'], dtype='object')

In [8]:
df.dtypes

roll       int64
name      object
class     object
marks    float64
age        int64
dtype: object

In [9]:
df.head()

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20

In [10]:
df.tail()

   roll    name class  marks  age
5     6  ayesha    BE  49.55   20
6     7    amar    BE  65.34   19
7     8   amita    BE  68.33   23
8     9    amol    TE  56.75   20
9    10   anmol    BE  78.66   21

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   roll    10 non-null     int64
 1   name    10 non-null     object
 2   class   10 non-null     object
 3   marks   10 non-null     float64
 4   age     10 non-null     int64
dtypes: float64(1), int64(2), object(2)
memory usage: 528.0+ bytes

In [12]:
df.describe()

           roll      marks        age
count  10.00000  10.000000  10.000000
mean    5.50000  64.499000  20.500000
std     3.02765   9.207179   1.269296
min     1.00000  49.550000  19.000000
25%     3.25000  57.520000  20.000000
50%     5.50000  64.310000  20.000000
75%     7.75000  69.327500  21.000000
max    10.00000  78.660000  23.000000

In [13]:
x = df.iloc[3:9, 1:4]

In [14]:
x

      name class  marks
3  ajinkya    TE  69.66
4     asha    TE  63.28
5   ayesha    BE  49.55
6     amar    BE  65.34
7    amita    BE  68.33
8     amol    TE  56.75

In [15]:
x = df['name']

In [16]:
x

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object

In [17]:
df[['name','class','marks']]

      name class  marks
0     anil    TE  56.77
1     amit    TE  59.77
2   aniket    BE  76.88
3  ajinkya    TE  69.66
4     asha    TE  63.28
5   ayesha    BE  49.55
6     amar    BE  65.34
7    amita    BE  68.33
8     amol    TE  56.75
9    anmol    BE  78.66

In [18]:
df['marks'].mean()

64.499

In [19]:
df['marks'].max()

78.66

In [20]:
df['marks'].min()

49.55

In [21]:
df['marks'].sum()

644.9899999999999

In [22]:
df['marks'].std()

9.207178901994535

In [23]:
df['class'].mode()

0    BE
1    TE
Name: class, dtype: object

In [24]:
df['class'].value_counts()

class
TE    5
BE    5
Name: count, dtype: int64

In [25]:
df['marks'] + 0.5

0    57.27
1    60.27
2    77.38
3    70.16
4    63.78
5    50.05
6    65.84
7    68.83
8    57.25
9    79.16
Name: marks, dtype: float64

In [26]:
df['marks'] = df['marks'] + 0.5

In [27]:
df

   roll     name class  marks  age
0     1     anil    TE  57.27   22
1     2     amit    TE  60.27   21
2     3   aniket    BE  77.38   19
3     4  ajinkya    TE  70.16   20
4     5     asha    TE  63.78   20
5     6   ayesha    BE  50.05   20
6     7     amar    BE  65.84   19
7     8    amita    BE  68.83   23
8     9     amol    TE  57.25   20
9    10    anmol    BE  79.16   21

In [28]:
df['marks'] > 60

0    False
1     True
2     True
3     True
4     True
5    False
6     True
7     True
8    False
9     True
Name: marks, dtype: bool

In [29]:
df[df['marks'] > 60]

   roll     name class  marks  age
1     2     amit    TE  60.27   21
2     3   aniket    BE  77.38   19
3     4  ajinkya    TE  70.16   20
4     5     asha    TE  63.78   20
6     7     amar    BE  65.84   19
7     8    amita    BE  68.83   23
9    10    anmol    BE  79.16   21

In [30]:
x = df[(df['marks'] > 60) & (df['class'] == 'BE')]

In [31]:
x

   roll    name class  marks  age
2     3  aniket    BE  77.38   19
6     7    amar    BE  65.84   19
7     8   amita    BE  68.83   23
9    10   anmol    BE  79.16   21

In [32]:
x.to_csv('output.csv', index=False)